/**********************************************************************************
 * 
 * @author lzy
* 2018年12月13日 下午7:26:50
 **********************************************************************************/
package lzy.commons.utils;

import java.nio.charset.Charset;
import java.util.Random;

import org.apache.commons.codec.digest.DigestUtils;
import org.apache.commons.codec.digest.Md5Crypt;

/**********************************************************************************
 * 
 * @author lzy
* 2018年12月13日 下午7:26:50
 **********************************************************************************/
public class StringUtils extends org.apache.commons.lang3.StringUtils {
	/**********************************************************************************
	 * 将手机号中间4位替换为*号
	 * @param phone 手机号
	 * @return 中间四位替换为****之后的手机号
	 * @author lzy
* 2018年12月13日 下午7:27:54
	 **********************************************************************************/
	public static String phoneReplace(String phone) {
		if(phone!=null) {
			return phone.replaceAll("(\\d{3})\\d{4}(\\d{4})", "$1****$2");
		}
		return null;
	}

	
	/*****************************************************************************************************************************************************
	 * 将字符串转换为唯一编码
	 * @param str 字符串
	 * @return 转换后的唯一编码
	 * @author lzy 2019年11月4日 下午2:56:32
	 *****************************************************************************************************************************************************/
	public static String uniqueCode(String str) {
		if(isBlank(str)) {
			return null;
		}
		return DigestUtils.md5Hex(str);
	}
	
	

}
